#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️``
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
module.irsa-ebs-csi.data.aws_partition.current: Reading...
data.aws_iam_policy.aws_managed_ecr_power_user_policy: Reading...
data.aws_iam_policy.aws_managed_ecr_readonly_policy: Reading...
aws_ecr_repository.bodhi_frontend: Refreshing state... [id=bodhi_frontend]
module.irsa-ebs-csi.data.aws_caller_identity.current: Reading...
module.vpc.aws_vpc.this[0]: Refreshing state... [id=vpc-0a9d8458221f98f37]
data.aws_iam_policy.aws_managed_read_only_access: Reading...
data.aws_iam_policy.aws_ec2_full_access: Reading...
aws_ecr_repository.bodhi_file_system: Refreshing state... [id=bodhi_file_system]
module.irsa-ebs-csi.data.aws_partition.current: Read complete after 0s [id=aws]
module.eks.data.aws_partition.current: Reading...
aws_s3_bucket.bodhi_file_bucket: Refreshing state... [id=bodhi-file-bucket]
module.eks.data.aws_partition.current: Read complete after 0s [id=aws]
data.aws_iam_policy.ebs_csi_policy: Reading...
data.aws_iam_policy.aws_managed_ecr_readonly_policy: Read complete after 0s [id=arn:aws:iam::aws:policy/AmazonEC2ContainerRegistryReadOnly]
data.aws_iam_policy.aws_ec2_full_access: Read complete after 0s [id=arn:aws:iam::aws:policy/AmazonEC2FullAccess]
data.aws_iam_policy.aws_managed_ecr_power_user_policy: Read complete after 0s [id=arn:aws:iam::aws:policy/AmazonEC2ContainerRegistryPowerUser]
module.eks.module.kms.data.aws_caller_identity.current[0]: Reading...
data.aws_iam_policy.ebs_csi_policy: Read complete after 0s [id=arn:aws:iam::aws:policy/service-role/AmazonEBSCSIDriverPolicy]
module.eks.data.aws_caller_identity.current: Reading...
module.eks.data.aws_iam_policy_document.assume_role_policy[0]: Reading...
data.aws_region.current: Reading...
module.eks.data.aws_iam_policy_document.assume_role_policy[0]: Read complete after 0s [id=2764486067]
data.aws_region.current: Read complete after 0s [id=ap-southeast-1]
data.aws_caller_identity.current: Reading...
module.eks.module.kms.data.aws_partition.current[0]: Reading...
module.eks.module.kms.data.aws_partition.current[0]: Read complete after 0s [id=aws]
aws_s3_bucket.bodhi_image_bucket: Refreshing state... [id=bodhi-image-bucket]
data.aws_iam_policy.aws_managed_read_only_access: Read complete after 0s [id=arn:aws:iam::aws:policy/ReadOnlyAccess]
module.eks.aws_cloudwatch_log_group.this[0]: Refreshing state... [id=/aws/eks/bodhi-int-eks/cluster]
module.irsa-ebs-csi.data.aws_caller_identity.current: Read complete after 0s [id=476114114107]
data.aws_iam_policy.aws_managed_s3_full_access: Reading...
data.aws_iam_policy.aws_managed_s3_full_access: Read complete after 0s [id=arn:aws:iam::aws:policy/AmazonS3FullAccess]
aws_iam_role.image_reflector_controller: Refreshing state... [id=image-reflector-controller]
data.aws_iam_policy.aws_managed_ecr_full_access: Reading...
module.eks.module.kms.data.aws_caller_identity.current[0]: Read complete after 1s [id=476114114107]
module.eks.aws_iam_role.this[0]: Refreshing state... [id=bodhi-int-eks-cluster-20241014091753202000000001]
data.aws_iam_policy.aws_managed_ecr_full_access: Read complete after 0s [id=arn:aws:iam::aws:policy/AmazonEC2ContainerRegistryFullAccess]
aws_iam_role_policy_attachment.tf_service_role_for_ecr_policy_attachment: Refreshing state... [id=image-reflector-controller-20241015101805373600000001]
module.eks.data.aws_caller_identity.current: Read complete after 1s [id=476114114107]
module.eks.data.aws_iam_session_context.current: Reading...
module.eks.aws_iam_role_policy_attachment.this["AmazonEKSClusterPolicy"]: Refreshing state... [id=bodhi-int-eks-cluster-20241014091753202000000001-20241014091753590700000003]
module.eks.aws_iam_role_policy_attachment.this["AmazonEKSVPCResourceController"]: Refreshing state... [id=bodhi-int-eks-cluster-20241014091753202000000001-20241014091753524700000002]
module.eks.data.aws_iam_session_context.current: Read complete after 0s [id=arn:aws:sts::476114114107:assumed-role/github-oidc-role/terraform-infra-provision-session]
module.eks.module.kms.aws_kms_key.this[0]: Refreshing state... [id=f2ff4364-802e-4cfb-b72e-c6df357506fd]
data.aws_caller_identity.current: Read complete after 1s [id=476114114107]
module.vpc.aws_default_security_group.this[0]: Refreshing state... [id=sg-00cd924de82b36051]
module.vpc.aws_default_route_table.default[0]: Refreshing state... [id=rtb-07a141daeb5cbc060]
module.vpc.aws_vpc_ipv4_cidr_block_association.this[0]: Refreshing state... [id=vpc-cidr-assoc-006a1e9311cf11f88]
module.eks.aws_security_group.cluster[0]: Refreshing state... [id=sg-04958eba1b3abe078]
module.vpc.aws_default_network_acl.this[0]: Refreshing state... [id=acl-00858e7f3e8e60f5c]
module.eks.aws_security_group.node[0]: Refreshing state... [id=sg-0559079df1e6144e8]
module.vpc.aws_subnet.private[1]: Refreshing state... [id=subnet-05a2c3d6a7b1b2837]
module.vpc.aws_subnet.private[2]: Refreshing state... [id=subnet-010d0dc62bd940540]
module.vpc.aws_subnet.private[3]: Refreshing state... [id=subnet-0b47eaae98c25f132]
module.vpc.aws_subnet.private[4]: Refreshing state... [id=subnet-08f964cd354acfa23]
module.vpc.aws_subnet.private[5]: Refreshing state... [id=subnet-010543bc138fcea50]
module.vpc.aws_subnet.private[0]: Refreshing state... [id=subnet-0e85ca0fce059eb11]
module.vpc.aws_route_table.private[0]: Refreshing state... [id=rtb-02e96125f1d14517e]
module.vpc.aws_internet_gateway.this[0]: Refreshing state... [id=igw-0669be7fff14179ad]
module.vpc.aws_route_table.private[1]: Refreshing state... [id=rtb-056120aae89290e81]
module.vpc.aws_route_table.private[2]: Refreshing state... [id=rtb-06a67527fc11e591a]
module.vpc.aws_route_table.public[0]: Refreshing state... [id=rtb-0747f29838df91d97]
module.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-0813788553314e761]
module.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-031d07681118b1fa5]
module.vpc.aws_subnet.public[2]: Refreshing state... [id=subnet-0e7d915b884c211c1]
module.vpc.aws_subnet.public[3]: Refreshing state... [id=subnet-0e19b1c52e06a29a9]
module.vpc.aws_subnet.public[4]: Refreshing state... [id=subnet-0baf858c54c6671c5]
module.vpc.aws_subnet.public[5]: Refreshing state... [id=subnet-03caccdd614823f7a]
module.eks.module.kms.aws_kms_alias.this["cluster"]: Refreshing state... [id=alias/eks/bodhi-int-eks]
module.vpc.aws_eip.nat[0]: Refreshing state... [id=eipalloc-0ea25e2b01d757771]
module.vpc.aws_eip.nat[2]: Refreshing state... [id=eipalloc-0a64fef9f2231fb55]
module.vpc.aws_eip.nat[1]: Refreshing state... [id=eipalloc-0dfc3b169d203524d]
module.eks.aws_security_group_rule.node["ingress_cluster_4443_webhook"]: Refreshing state... [id=sgrule-1245629660]
module.eks.aws_security_group_rule.node["node_exporter_ingress_rule"]: Refreshing state... [id=sgrule-2719681735]
module.eks.aws_security_group_rule.node["ingress_self_coredns_tcp"]: Refreshing state... [id=sgrule-1694742451]
module.eks.aws_security_group_rule.node["egress_all"]: Refreshing state... [id=sgrule-2114199985]
module.eks.aws_security_group_rule.node["ingress_cluster_9443_webhook"]: Refreshing state... [id=sgrule-4102136992]
module.eks.aws_security_group_rule.node["ingress_cluster_kubelet"]: Refreshing state... [id=sgrule-1989882638]
module.eks.aws_security_group_rule.node["ingress_self_coredns_udp"]: Refreshing state... [id=sgrule-3244037212]
module.eks.aws_security_group_rule.node["ingress_cluster_8443_webhook"]: Refreshing state... [id=sgrule-2418055019]
module.eks.aws_security_group_rule.node["prometheus_service_ingress_rule"]: Refreshing state... [id=sgrule-2624851430]
module.eks.aws_security_group_rule.node["postgresql_service_ingress_rule_1"]: Refreshing state... [id=sgrule-206798224]
module.eks.aws_security_group_rule.node["ingress_nodes_ephemeral"]: Refreshing state... [id=sgrule-1291461012]
module.eks.aws_security_group_rule.node["postgresql_service_ingress_rule_2"]: Refreshing state... [id=sgrule-1451725928]
module.eks.aws_security_group_rule.node["ingress_cluster_443"]: Refreshing state... [id=sgrule-2684604780]
module.eks.aws_security_group_rule.node["ingress_cluster_6443_webhook"]: Refreshing state... [id=sgrule-2205985610]
module.eks.aws_security_group_rule.node["olm_package_server_ingress_rule"]: Refreshing state... [id=sgrule-782237463]
module.eks.aws_security_group_rule.cluster["ingress_nodes_443"]: Refreshing state... [id=sgrule-3959025701]
module.eks.aws_iam_policy.cluster_encryption[0]: Refreshing state... [id=arn:aws:iam::476114114107:policy/bodhi-int-eks-cluster-ClusterEncryption20241014091821157400000008]
module.vpc.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-0153a91528cacd0a6]
module.vpc.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-075b0b39a54e09b76]
module.vpc.aws_route_table_association.private[2]: Refreshing state... [id=rtbassoc-0e3ef233597c72aa4]
module.vpc.aws_route_table_association.private[3]: Refreshing state... [id=rtbassoc-07317b15b5e597901]
module.vpc.aws_route_table_association.private[5]: Refreshing state... [id=rtbassoc-01295f817414188b2]
module.vpc.aws_route_table_association.private[4]: Refreshing state... [id=rtbassoc-0197ba485f733e68c]
module.vpc.aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-0747f29838df91d971080289494]
module.vpc.aws_route_table_association.public[5]: Refreshing state... [id=rtbassoc-048aba9613a035864]
module.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-03c323020cb673ede]
module.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-055a21142ac3b8882]
module.vpc.aws_route_table_association.public[2]: Refreshing state... [id=rtbassoc-0b42c7a702eb7e567]
module.vpc.aws_route_table_association.public[3]: Refreshing state... [id=rtbassoc-0fe39e7335c334869]
module.vpc.aws_route_table_association.public[4]: Refreshing state... [id=rtbassoc-00cb15d5986ad6d75]
module.eks.aws_iam_role_policy_attachment.cluster_encryption[0]: Refreshing state... [id=bodhi-int-eks-cluster-20241014091753202000000001-20241014091821382100000009]
module.vpc.aws_nat_gateway.this[2]: Refreshing state... [id=nat-045775dd6d28002fd]
module.vpc.aws_nat_gateway.this[0]: Refreshing state... [id=nat-093263e973120428c]
module.vpc.aws_nat_gateway.this[1]: Refreshing state... [id=nat-033590265c7997c91]
module.eks.aws_eks_cluster.this[0]: Refreshing state... [id=bodhi-int-eks]
module.eks.module.eks_managed_node_group["int"].data.aws_caller_identity.current: Reading...
module.eks.module.eks_managed_node_group["k8s-core"].data.aws_caller_identity.current: Reading...
module.eks.module.eks_managed_node_group["k8s-core"].data.aws_partition.current: Reading...
module.eks.module.eks_managed_node_group["k8s-core"].data.aws_partition.current: Read complete after 0s [id=aws]
module.eks.module.eks_managed_node_group["int"].data.aws_partition.current: Reading...
module.eks.module.eks_managed_node_group["int"].data.aws_partition.current: Read complete after 0s [id=aws]
module.eks.module.eks_managed_node_group["k8s-core"].data.aws_iam_policy_document.assume_role_policy[0]: Reading...
module.eks.module.eks_managed_node_group["k8s-core"].data.aws_iam_policy_document.assume_role_policy[0]: Read complete after 0s [id=2560088296]
module.eks.module.eks_managed_node_group["int"].data.aws_iam_policy_document.assume_role_policy[0]: Reading...
module.eks.module.eks_managed_node_group["int"].data.aws_iam_policy_document.assume_role_policy[0]: Read complete after 0s [id=2560088296]
module.eks.module.eks_managed_node_group["k8s-core"].aws_iam_role.this[0]: Refreshing state... [id=k8s-core-eks-node-group-20241014093431756400000002]
module.eks.module.eks_managed_node_group["int"].aws_iam_role.this[0]: Refreshing state... [id=int-eks-node-group-20241014093431551400000001]
module.eks.module.eks_managed_node_group["int"].data.aws_caller_identity.current: Read complete after 0s [id=476114114107]
module.vpc.aws_route.private_nat_gateway[0]: Refreshing state... [id=r-rtb-02e96125f1d14517e1080289494]
module.vpc.aws_route.private_nat_gateway[2]: Refreshing state... [id=r-rtb-06a67527fc11e591a1080289494]
module.vpc.aws_route.private_nat_gateway[1]: Refreshing state... [id=r-rtb-056120aae89290e811080289494]
module.eks.module.eks_managed_node_group["k8s-core"].data.aws_caller_identity.current: Read complete after 0s [id=476114114107]
module.eks.module.eks_managed_node_group["k8s-core"].aws_iam_role_policy_attachment.this["AmazonEKSWorkerNodePolicy"]: Refreshing state... [id=k8s-core-eks-node-group-20241014093431756400000002-20241014093432044000000003]
module.eks.module.eks_managed_node_group["k8s-core"].aws_iam_role_policy_attachment.this["AmazonEC2ContainerRegistryReadOnly"]: Refreshing state... [id=k8s-core-eks-node-group-20241014093431756400000002-20241014093432279800000005]
module.eks.module.eks_managed_node_group["k8s-core"].aws_iam_role_policy_attachment.this["AmazonEKS_CNI_Policy"]: Refreshing state... [id=k8s-core-eks-node-group-20241014093431756400000002-20241014093432160400000004]
module.eks.module.eks_managed_node_group["int"].aws_iam_role_policy_attachment.this["AmazonEKS_CNI_Policy"]: Refreshing state... [id=int-eks-node-group-20241014093431551400000001-20241014093432542500000008]
module.eks.module.eks_managed_node_group["int"].aws_iam_role_policy_attachment.this["AmazonEC2ContainerRegistryReadOnly"]: Refreshing state... [id=int-eks-node-group-20241014093431551400000001-20241014093432373700000006]
module.eks.module.eks_managed_node_group["int"].aws_iam_role_policy_attachment.this["AmazonEKSWorkerNodePolicy"]: Refreshing state... [id=int-eks-node-group-20241014093431551400000001-20241014093432477500000007]
module.eks.aws_eks_access_entry.this["cluster_creator"]: Refreshing state... [id=bodhi-int-eks:arn:aws:iam::476114114107:role/github-oidc-role]
module.eks.aws_iam_openid_connect_provider.oidc_provider[0]: Refreshing state... [id=arn:aws:iam::476114114107:oidc-provider/oidc.eks.ap-southeast-1.amazonaws.com/id/63F70535F3EBEB91D99661071E0DDAA4]
module.eks.time_sleep.this[0]: Refreshing state... [id=2024-10-14T09:44:00Z]
module.eks.module.eks_managed_node_group["int"].module.user_data.null_resource.validate_cluster_service_cidr: Refreshing state... [id=3261890501206656181]
module.eks.module.eks_managed_node_group["k8s-core"].module.user_data.null_resource.validate_cluster_service_cidr: Refreshing state... [id=7314370506267146074]
module.eks.module.eks_managed_node_group["int"].aws_launch_template.this[0]: Refreshing state... [id=lt-01490e17eecf85913]
module.eks.module.eks_managed_node_group["k8s-core"].aws_launch_template.this[0]: Refreshing state... [id=lt-0d41e868704652f3f]
module.eks.aws_eks_access_policy_association.this["cluster_creator_admin"]: Refreshing state... [id=bodhi-int-eks#arn:aws:iam::476114114107:role/github-oidc-role#arn:aws:eks::aws:cluster-access-policy/AmazonEKSClusterAdminPolicy]
module.eks.module.eks_managed_node_group["int"].aws_eks_node_group.this[0]: Refreshing state... [id=bodhi-int-eks:int-20241020105419174700000001]
module.eks.module.eks_managed_node_group["k8s-core"].aws_eks_node_group.this[0]: Refreshing state... [id=bodhi-int-eks:k8s-core-20241014100332495600000001]
module.irsa-ebs-csi.aws_iam_role.this[0]: Refreshing state... [id=AmazonEKSTFEBSCSIRole-ap-east-1-bodhi-int-eks]
module.irsa-ebs-csi.aws_iam_role_policy_attachment.custom[0]: Refreshing state... [id=AmazonEKSTFEBSCSIRole-ap-east-1-bodhi-int-eks-2024101409433311580000000c]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.eks.aws_eks_cluster.this[0] has been deleted
  - resource "aws_eks_cluster" "this" {
      - arn                           = "arn:aws:eks:ap-southeast-1:476114114107:cluster/bodhi-int-eks" -> null
      - certificate_authority         = [
          - {
              - data = "LS0tLS1CRUdJTiBDRVJUSUZJQ0FURS0tLS0tCk1JSURCVENDQWUyZ0F3SUJBZ0lJY0ZkOXNkNzZ1THN3RFFZSktvWklodmNOQVFFTEJRQXdGVEVUTUJFR0ExVUUKQXhNS2EzVmlaWEp1WlhSbGN6QWVGdzB5TkRFd01UUXdPVE16TkRsYUZ3MHpOREV3TVRJd09UTTRORGxhTUJVeApFekFSQmdOVkJBTVRDbXQxWW1WeWJtVjBaWE13Z2dFaU1BMEdDU3FHU0liM0RRRUJBUVVBQTRJQkR3QXdnZ0VLCkFvSUJBUUM1bzNZN3VzS1FOeFpQenBGcWxCUnNGTmtQYTlJMEdSMzhzREhaVmRCSVptc2VWaDBkTTFuWWVsbTMKNjRiSTJWQmJDZ1M3STY5eHg3Q2dZdEZyOXZ0NWF1MmtsMTR2V05nMVpaOFNML0s5TWc4MDRkLzRSelVJRmR3RQppZTJieDZ5OEZudmdEcHk1UnFjSzR0b1hvL1dYdk84RHhMckdZK0JaejRIbUFBVGx0SzVuWTVGVXhKVnJOZUpCCitWaUgyR0xPTWtsVHVKRDRKZTRCRzA4Q0hwTm5BeEhudjMwZm9PNjZrdnN5Ty9uc1I4bWxCeTFzTnE2SWVUUVIKK2Y2KzFJTjMrVlQyVHhud0l1bjlmWDc1akVqUkVvQzk0OGRDaG9Ecnl1U1FDKzM2YVpIS1RjVlBFVVVKNWprWQpTZkZhSHlRYlQzcnBvUVFLTGNzcmJTakh2M2tEQWdNQkFBR2pXVEJYTUE0R0ExVWREd0VCL3dRRUF3SUNwREFQCkJnTlZIUk1CQWY4RUJUQURBUUgvTUIwR0ExVWREZ1FXQkJUK0JkTXNzK1BjYmErVWFNb3dQN2VRNStDdklUQVYKQmdOVkhSRUVEakFNZ2dwcmRXSmxjbTVsZEdWek1BMEdDU3FHU0liM0RRRUJDd1VBQTRJQkFRQjA3a2tlUTZwYgowMmdaL1RrMWZYOGczVEwxVEZXS1lVRG51V2tIcms2VlB1NWk0TnpSMGZWSXJYTFI2MnE1VU4wbmwybDFXREhVCkZHSGVmeWFLZFdIY04wZ29veGF3TlVvNldsQTk4di9ZTXJVQ3VyQmNMSHdPUXR6TGtkL29lUVBsb1JubnNYVTkKWU9JTFVNY1ErcHh4WGdTMlJnMzBsVFZKYlc0SGM5WnNGS0hmNys5RzNsNkJQNVd2Ukl3RndSMVNHY3RHQlVMWgppK3U0dTY0cko1clpEMGRpZ3h4S2h1TEVCdG5SR25hSlZSQ3RENWJlUk8xTmtlMFhOZit5NmlBRDM4M2wwOG5aCk00YlptZTJsNjBhV0xGL1RoU1FSd0g4RkxURGxOcTBJckNrUDRxSUlpeHZoNW02UGx4Y294UmM5Snk2enFPekkKdGE3UkhSbktPVldTCi0tLS0tRU5EIENFUlRJRklDQVRFLS0tLS0K"
            },
        ] -> null
      - endpoint                      = "https://63F70535F3EBEB91D99661071E0DDAA4.gr7.ap-southeast-1.eks.amazonaws.com" -> null
        id                            = "bodhi-int-eks"
      - identity                      = [
          - {
              - oidc = [
                  - {
                      - issuer = "https://oidc.eks.ap-southeast-1.amazonaws.com/id/63F70535F3EBEB91D99661071E0DDAA4"
                    },
                ]
            },
        ] -> null
      - name                          = "bodhi-int-eks" -> null
      - platform_version              = "eks.13" -> null
      - status                        = "ACTIVE" -> null
        tags                          = {
            "terraform-aws-modules" = "eks"
        }
      - version                       = "1.29" -> null
        # (5 unchanged attributes hidden)

      - kubernetes_network_config {
          - ip_family         = "ipv4" -> null
          - service_ipv4_cidr = "172.20.0.0/16" -> null
            # (1 unchanged attribute hidden)
        }

      - vpc_config {
          - cluster_security_group_id = "sg-0f97f38461bef28b9" -> null
            # (6 unchanged attributes hidden)
        }

        # (4 unchanged blocks hidden)
    }

  # module.eks.aws_security_group.cluster[0] has been deleted
  - resource "aws_security_group" "cluster" {
      - arn                    = "arn:aws:ec2:ap-southeast-1:476114114107:security-group/sg-04958eba1b3abe078" -> null
      - id                     = "sg-04958eba1b3abe078" -> null
        name                   = "bodhi-int-eks-cluster-20241014091807674300000005"
        tags                   = {
            "Name" = "bodhi-int-eks-cluster"
        }
        # (8 unchanged attributes hidden)
    }

  # module.eks.aws_security_group.node[0] has been deleted
  - resource "aws_security_group" "node" {
      - arn                    = "arn:aws:ec2:ap-southeast-1:476114114107:security-group/sg-0559079df1e6144e8" -> null
      - id                     = "sg-0559079df1e6144e8" -> null
        name                   = "bodhi-int-eks-node-20241014091807672200000004"
        tags                   = {
            "Name"                                = "bodhi-int-eks-node"
            "kubernetes.io/cluster/bodhi-int-eks" = "owned"
        }
        # (8 unchanged attributes hidden)
    }

  # module.vpc.aws_internet_gateway.this[0] has been deleted
  - resource "aws_internet_gateway" "this" {
      - arn      = "arn:aws:ec2:ap-southeast-1:476114114107:internet-gateway/igw-0669be7fff14179ad" -> null
      - id       = "igw-0669be7fff14179ad" -> null
        tags     = {
            "Name"              = "terraform-managed-eks-vpc"
            "environment"       = "int"
            "terraform-managed" = "true"
        }
        # (3 unchanged attributes hidden)
    }

  # module.vpc.aws_route.public_internet_gateway[0] has been deleted
  - resource "aws_route" "public_internet_gateway" {
      - id                          = "r-rtb-0747f29838df91d971080289494" -> null
        # (18 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.vpc.aws_route_table.public[0] has been deleted
  - resource "aws_route_table" "public" {
      - id               = "rtb-0747f29838df91d97" -> null
        tags             = {
            "Name"              = "terraform-managed-eks-vpc-public"
            "environment"       = "int"
            "terraform-managed" = "true"
        }
        # (6 unchanged attributes hidden)
    }

  # module.vpc.aws_vpc.this[0] has been deleted
  - resource "aws_vpc" "this" {
      - arn                                  = "arn:aws:ec2:ap-southeast-1:476114114107:vpc/vpc-0a9d8458221f98f37" -> null
      - cidr_block                           = "10.0.0.0/16" -> null
      - default_network_acl_id               = "acl-00858e7f3e8e60f5c" -> null
      - default_route_table_id               = "rtb-07a141daeb5cbc060" -> null
      - default_security_group_id            = "sg-00cd924de82b36051" -> null
      - enable_dns_hostnames                 = true -> null
      - enable_dns_support                   = true -> null
      - id                                   = "vpc-0a9d8458221f98f37" -> null
      - instance_tenancy                     = "default" -> null
      - main_route_table_id                  = "rtb-07a141daeb5cbc060" -> null
      - owner_id                             = "476114114107" -> null
        tags                                 = {
            "Name"              = "terraform-managed-eks-vpc"
            "environment"       = "int"
            "terraform-managed" = "true"
        }
        # (9 unchanged attributes hidden)
    }

  # module.vpc.aws_vpc_ipv4_cidr_block_association.this[0] has been deleted
  - resource "aws_vpc_ipv4_cidr_block_association" "this" {
        id         = "vpc-cidr-assoc-006a1e9311cf11f88"
      - vpc_id     = "vpc-0a9d8458221f98f37" -> null
        # (1 unchanged attribute hidden)
    }

  # module.eks.module.eks_managed_node_group["int"].aws_eks_node_group.this[0] has been deleted
  - resource "aws_eks_node_group" "this" {
      - arn                    = "arn:aws:eks:ap-southeast-1:476114114107:nodegroup/bodhi-int-eks/int-20241020105419174700000001/aac954c8-2702-9e35-ccb2-89cf3ffb8ef7" -> null
      - id                     = "bodhi-int-eks:int-20241020105419174700000001" -> null
      - labels                 = {
          - "nodegroup" = "int"
        } -> null
      - resources              = [
          - {
              - autoscaling_groups              = [
                  - {
                      - name = "eks-int-20241020105419174700000001-aac954c8-2702-9e35-ccb2-89cf3ffb8ef7"
                    },
                ]
                # (1 unchanged attribute hidden)
            },
        ] -> null
      - status                 = "ACTIVE" -> null
        tags                   = {
            "Name"                                    = "int"
            "k8s.io/cluster-autoscaler/bodhi-int-eks" = "owned"
            "k8s.io/cluster-autoscaler/enabled"       = "TRUE"
        }
        # (12 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.eks.module.eks_managed_node_group["k8s-core"].aws_eks_node_group.this[0] has been deleted
  - resource "aws_eks_node_group" "this" {
      - arn                    = "arn:aws:eks:ap-southeast-1:476114114107:nodegroup/bodhi-int-eks/k8s-core-20241014100332495600000001/8ac9453d-d4cb-3b79-5a63-3ea9fb3320e5" -> null
      - id                     = "bodhi-int-eks:k8s-core-20241014100332495600000001" -> null
      - labels                 = {
          - "nodegroup" = "k8s-core"
        } -> null
      - resources              = [
          - {
              - autoscaling_groups              = [
                  - {
                      - name = "eks-k8s-core-20241014100332495600000001-8ac9453d-d4cb-3b79-5a63-3ea9fb3320e5"
                    },
                ]
                # (1 unchanged attribute hidden)
            },
        ] -> null
      - status                 = "ACTIVE" -> null
        tags                   = {
            "Name"                                    = "k8s-core"
            "k8s.io/cluster-autoscaler/bodhi-int-eks" = "owned"
            "k8s.io/cluster-autoscaler/enabled"       = "TRUE"
        }
        # (12 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement
+/- create replacement and then destroy
 <= read (data resources)

Terraform will perform the following actions:

  # aws_ecr_repository.msccoin_file_system will be created
  + resource "aws_ecr_repository" "msccoin_file_system" {
      + arn                  = (known after apply)
      + id                   = (known after apply)
      + image_tag_mutability = "MUTABLE"
      + name                 = "msccoin_file_system"
      + registry_id          = (known after apply)
      + repository_url       = (known after apply)
      + tags_all             = (known after apply)
    }

  # aws_ecr_repository.msccoin_frontend will be created
  + resource "aws_ecr_repository" "msccoin_frontend" {
      + arn                  = (known after apply)
      + id                   = (known after apply)
      + image_tag_mutability = "MUTABLE"
      + name                 = "msccoin_frontend"
      + registry_id          = (known after apply)
      + repository_url       = (known after apply)
      + tags_all             = (known after apply)
    }

  # module.eks.data.tls_certificate.this[0] will be read during apply
  # (config refers to values not yet known)
 <= data "tls_certificate" "this" {
      + certificates = (known after apply)
      + id           = (known after apply)
      + url          = (known after apply)
    }

  # module.eks.aws_cloudwatch_log_group.this[0] must be replaced
+/- resource "aws_cloudwatch_log_group" "this" {
      ~ arn               = "arn:aws:logs:ap-southeast-1:476114114107:log-group:/aws/eks/bodhi-int-eks/cluster" -> (known after apply)
      ~ id                = "/aws/eks/bodhi-int-eks/cluster" -> (known after apply)
      ~ log_group_class   = "STANDARD" -> (known after apply)
      ~ name              = "/aws/eks/bodhi-int-eks/cluster" -> "/aws/eks/msccoin-int-eks/cluster" # forces replacement
      + name_prefix       = (known after apply)
      ~ tags              = {
          ~ "Name" = "/aws/eks/bodhi-int-eks/cluster" -> "/aws/eks/msccoin-int-eks/cluster"
        }
      ~ tags_all          = {
          ~ "Name" = "/aws/eks/bodhi-int-eks/cluster" -> "/aws/eks/msccoin-int-eks/cluster"
        }
        # (3 unchanged attributes hidden)
    }

  # module.eks.aws_eks_access_entry.this["cluster_creator"] will be created
  + resource "aws_eks_access_entry" "this" {
      + access_entry_arn  = (known after apply)
      + cluster_name      = "msccoin-int-eks"
      + created_at        = (known after apply)
      + id                = (known after apply)
      + kubernetes_groups = (known after apply)
      + modified_at       = (known after apply)
      + principal_arn     = "arn:aws:iam::476114114107:role/github-oidc-role"
      + tags_all          = (known after apply)
      + type              = "STANDARD"
      + user_name         = (known after apply)
    }

  # module.eks.aws_eks_access_policy_association.this["cluster_creator_admin"] will be created
  + resource "aws_eks_access_policy_association" "this" {
      + associated_at = (known after apply)
      + cluster_name  = "msccoin-int-eks"
      + id            = (known after apply)
      + modified_at   = (known after apply)
      + policy_arn    = "arn:aws:eks::aws:cluster-access-policy/AmazonEKSClusterAdminPolicy"
      + principal_arn = "arn:aws:iam::476114114107:role/github-oidc-role"

      + access_scope {
          + type = "cluster"
        }
    }

  # module.eks.aws_eks_cluster.this[0] will be created
  + resource "aws_eks_cluster" "this" {
      + arn                           = (known after apply)
      + bootstrap_self_managed_addons = true
      + certificate_authority         = (known after apply)
      + cluster_id                    = (known after apply)
      + created_at                    = (known after apply)
      + enabled_cluster_log_types     = [
          + "api",
          + "audit",
          + "authenticator",
        ]
      + endpoint                      = (known after apply)
      + id                            = (known after apply)
      + identity                      = (known after apply)
      + name                          = "msccoin-int-eks"
      + platform_version              = (known after apply)
      + role_arn                      = (known after apply)
      + status                        = (known after apply)
      + tags                          = {
          + "terraform-aws-modules" = "eks"
        }
      + tags_all                      = {
          + "terraform-aws-modules" = "eks"
        }
      + version                       = "1.29"

      + access_config {
          + authentication_mode                         = "API_AND_CONFIG_MAP"
          + bootstrap_cluster_creator_admin_permissions = false
        }

      + encryption_config {
          + resources = [
              + "secrets",
            ]

          + provider {
              + key_arn = "arn:aws:kms:ap-southeast-1:476114114107:key/f2ff4364-802e-4cfb-b72e-c6df357506fd"
            }
        }

      + kubernetes_network_config {
          + ip_family         = "ipv4"
          + service_ipv4_cidr = (known after apply)
          + service_ipv6_cidr = (known after apply)
        }

      + timeouts {}

      + vpc_config {
          + cluster_security_group_id = (known after apply)
          + endpoint_private_access   = false
          + endpoint_public_access    = true
          + public_access_cidrs       = [
              + "0.0.0.0/0",
            ]
          + security_group_ids        = (known after apply)
          + subnet_ids                = (known after apply)
          + vpc_id                    = (known after apply)
        }
    }

  # module.eks.aws_iam_openid_connect_provider.oidc_provider[0] must be replaced
-/+ resource "aws_iam_openid_connect_provider" "oidc_provider" {
      ~ arn             = "arn:aws:iam::476114114107:oidc-provider/oidc.eks.ap-southeast-1.amazonaws.com/id/63F70535F3EBEB91D99661071E0DDAA4" -> (known after apply)
      ~ id              = "arn:aws:iam::476114114107:oidc-provider/oidc.eks.ap-southeast-1.amazonaws.com/id/63F70535F3EBEB91D99661071E0DDAA4" -> (known after apply)
      ~ tags            = {
          ~ "Name" = "bodhi-int-eks-eks-irsa" -> "msccoin-int-eks-eks-irsa"
        }
      ~ tags_all        = {
          ~ "Name" = "bodhi-int-eks-eks-irsa" -> "msccoin-int-eks-eks-irsa"
        }
      ~ thumbprint_list = [
          - "9e99a48a9960b14926bb7f3b02e22da2b0ab7280",
        ] -> (known after apply)
      ~ url             = "oidc.eks.ap-southeast-1.amazonaws.com/id/63F70535F3EBEB91D99661071E0DDAA4" # forces replacement -> (known after apply) # forces replacement
        # (1 unchanged attribute hidden)
    }

  # module.eks.aws_iam_policy.cluster_encryption[0] must be replaced
-/+ resource "aws_iam_policy" "cluster_encryption" {
      ~ arn              = "arn:aws:iam::476114114107:policy/bodhi-int-eks-cluster-ClusterEncryption20241014091821157400000008" -> (known after apply)
      ~ attachment_count = 1 -> (known after apply)
      ~ id               = "arn:aws:iam::476114114107:policy/bodhi-int-eks-cluster-ClusterEncryption20241014091821157400000008" -> (known after apply)
      ~ name             = "bodhi-int-eks-cluster-ClusterEncryption20241014091821157400000008" -> (known after apply)
      ~ name_prefix      = "bodhi-int-eks-cluster-ClusterEncryption" -> "msccoin-int-eks-cluster-ClusterEncryption" # forces replacement
      ~ policy_id        = "ANPAW5WU42Y55DQQDJDAE" -> (known after apply)
      - tags             = {} -> null
      ~ tags_all         = {} -> (known after apply)
        # (3 unchanged attributes hidden)
    }

  # module.eks.aws_iam_role.this[0] must be replaced
+/- resource "aws_iam_role" "this" {
      ~ arn                   = "arn:aws:iam::476114114107:role/bodhi-int-eks-cluster-20241014091753202000000001" -> (known after apply)
      ~ create_date           = "2024-10-14T09:17:53Z" -> (known after apply)
      ~ id                    = "bodhi-int-eks-cluster-20241014091753202000000001" -> (known after apply)
      ~ managed_policy_arns   = [
          - "arn:aws:iam::476114114107:policy/bodhi-int-eks-cluster-ClusterEncryption20241014091821157400000008",
          - "arn:aws:iam::aws:policy/AmazonEKSClusterPolicy",
          - "arn:aws:iam::aws:policy/AmazonEKSVPCResourceController",
        ] -> (known after apply)
      ~ name                  = "bodhi-int-eks-cluster-20241014091753202000000001" -> (known after apply)
      ~ name_prefix           = "bodhi-int-eks-cluster-" -> "msccoin-int-eks-cluster-" # forces replacement
      - tags                  = {} -> null
      ~ tags_all              = {} -> (known after apply)
      ~ unique_id             = "AROAW5WU42Y5YLCU2XR4E" -> (known after apply)
        # (6 unchanged attributes hidden)

      - inline_policy {
          - name   = "bodhi-int-eks-cluster" -> null
          - policy = jsonencode(
                {
                  - Statement = [
                      - {
                          - Action   = [
                              - "logs:CreateLogGroup",
                            ]
                          - Effect   = "Deny"
                          - Resource = "*"
                        },
                    ]
                  - Version   = "2012-10-17"
                }
            ) -> null
        }
      + inline_policy {
          + name   = "msccoin-int-eks-cluster"
          + policy = jsonencode(
                {
                  + Statement = [
                      + {
                          + Action   = [
                              + "logs:CreateLogGroup",
                            ]
                          + Effect   = "Deny"
                          + Resource = "*"
                        },
                    ]
                  + Version   = "2012-10-17"
                }
            )
        }
    }

  # module.eks.aws_iam_role_policy_attachment.cluster_encryption[0] must be replaced
-/+ resource "aws_iam_role_policy_attachment" "cluster_encryption" {
      ~ id         = "bodhi-int-eks-cluster-20241014091753202000000001-20241014091821382100000009" -> (known after apply)
      ~ policy_arn = "arn:aws:iam::476114114107:policy/bodhi-int-eks-cluster-ClusterEncryption20241014091821157400000008" # forces replacement -> (known after apply) # forces replacement
      ~ role       = "bodhi-int-eks-cluster-20241014091753202000000001" # forces replacement -> (known after apply) # forces replacement
    }

  # module.eks.aws_iam_role_policy_attachment.this["AmazonEKSClusterPolicy"] must be replaced
+/- resource "aws_iam_role_policy_attachment" "this" {
      ~ id         = "bodhi-int-eks-cluster-20241014091753202000000001-20241014091753590700000003" -> (known after apply)
      ~ role       = "bodhi-int-eks-cluster-20241014091753202000000001" # forces replacement -> (known after apply) # forces replacement
        # (1 unchanged attribute hidden)
    }

  # module.eks.aws_iam_role_policy_attachment.this["AmazonEKSVPCResourceController"] must be replaced
+/- resource "aws_iam_role_policy_attachment" "this" {
      ~ id         = "bodhi-int-eks-cluster-20241014091753202000000001-20241014091753524700000002" -> (known after apply)
      ~ role       = "bodhi-int-eks-cluster-20241014091753202000000001" # forces replacement -> (known after apply) # forces replacement
        # (1 unchanged attribute hidden)
    }

  # module.eks.aws_security_group.cluster[0] will be created
  + resource "aws_security_group" "cluster" {
      + arn                    = (known after apply)
      + description            = "EKS cluster security group"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = (known after apply)
      + name_prefix            = "msccoin-int-eks-cluster-"
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "msccoin-int-eks-cluster"
        }
      + tags_all               = {
          + "Name" = "msccoin-int-eks-cluster"
        }
      + vpc_id                 = (known after apply)
    }

  # module.eks.aws_security_group.node[0] will be created
  + resource "aws_security_group" "node" {
      + arn                    = (known after apply)
      + description            = "EKS node shared security group"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = (known after apply)
      + name_prefix            = "msccoin-int-eks-node-"
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name"                                  = "msccoin-int-eks-node"
          + "kubernetes.io/cluster/msccoin-int-eks" = "owned"
        }
      + tags_all               = {
          + "Name"                                  = "msccoin-int-eks-node"
          + "kubernetes.io/cluster/msccoin-int-eks" = "owned"
        }
      + vpc_id                 = (known after apply)
    }

  # module.eks.aws_security_group_rule.cluster["ingress_nodes_443"] will be created
  + resource "aws_security_group_rule" "cluster" {
      + description              = "Node groups to cluster API"
      + from_port                = 443
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 443
      + type                     = "ingress"
    }

  # module.eks.aws_security_group_rule.node["egress_all"] will be created
  + resource "aws_security_group_rule" "node" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + description              = "Allow all egress"
      + from_port                = 0
      + id                       = (known after apply)
      + prefix_list_ids          = []
      + protocol                 = "-1"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 0
      + type                     = "egress"
    }

  # module.eks.aws_security_group_rule.node["ingress_cluster_443"] will be created
  + resource "aws_security_group_rule" "node" {
      + description              = "Cluster API to node groups"
      + from_port                = 443
      + id                       = (known after apply)
      + prefix_list_ids          = []
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 443
      + type                     = "ingress"
    }

  # module.eks.aws_security_group_rule.node["ingress_cluster_4443_webhook"] will be created
  + resource "aws_security_group_rule" "node" {
      + description              = "Cluster API to node 4443/tcp webhook"
      + from_port                = 4443
      + id                       = (known after apply)
      + prefix_list_ids          = []
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 4443
      + type                     = "ingress"
    }

  # module.eks.aws_security_group_rule.node["ingress_cluster_6443_webhook"] will be created
  + resource "aws_security_group_rule" "node" {
      + description              = "Cluster API to node 6443/tcp webhook"
      + from_port                = 6443
      + id                       = (known after apply)
      + prefix_list_ids          = []
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 6443
      + type                     = "ingress"
    }

  # module.eks.aws_security_group_rule.node["ingress_cluster_8443_webhook"] will be created
  + resource "aws_security_group_rule" "node" {
      + description              = "Cluster API to node 8443/tcp webhook"
      + from_port                = 8443
      + id                       = (known after apply)
      + prefix_list_ids          = []
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 8443
      + type                     = "ingress"
    }

  # module.eks.aws_security_group_rule.node["ingress_cluster_9443_webhook"] will be created
  + resource "aws_security_group_rule" "node" {
      + description              = "Cluster API to node 9443/tcp webhook"
      + from_port                = 9443
      + id                       = (known after apply)
      + prefix_list_ids          = []
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 9443
      + type                     = "ingress"
    }

  # module.eks.aws_security_group_rule.node["ingress_cluster_kubelet"] will be created
  + resource "aws_security_group_rule" "node" {
      + description              = "Cluster API to node kubelets"
      + from_port                = 10250
      + id                       = (known after apply)
      + prefix_list_ids          = []
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 10250
      + type                     = "ingress"
    }

  # module.eks.aws_security_group_rule.node["ingress_nodes_ephemeral"] will be created
  + resource "aws_security_group_rule" "node" {
      + description              = "Node to node ingress on ephemeral ports"
      + from_port                = 1025
      + id                       = (known after apply)
      + prefix_list_ids          = []
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = true
      + source_security_group_id = (known after apply)
      + to_port                  = 65535
      + type                     = "ingress"
    }

  # module.eks.aws_security_group_rule.node["ingress_self_coredns_tcp"] will be created
  + resource "aws_security_group_rule" "node" {
      + description              = "Node to node CoreDNS"
      + from_port                = 53
      + id                       = (known after apply)
      + prefix_list_ids          = []
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = true
      + source_security_group_id = (known after apply)
      + to_port                  = 53
      + type                     = "ingress"
    }

  # module.eks.aws_security_group_rule.node["ingress_self_coredns_udp"] will be created
  + resource "aws_security_group_rule" "node" {
      + description              = "Node to node CoreDNS UDP"
      + from_port                = 53
      + id                       = (known after apply)
      + prefix_list_ids          = []
      + protocol                 = "udp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = true
      + source_security_group_id = (known after apply)
      + to_port                  = 53
      + type                     = "ingress"
    }

  # module.eks.aws_security_group_rule.node["postgresql_service_ingress_rule_1"] will be created
  + resource "aws_security_group_rule" "node" {
      + description              = "pg ingress 1"
      + from_port                = 15232
      + id                       = (known after apply)
      + prefix_list_ids          = []
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 15232
      + type                     = "ingress"
    }

  # module.eks.time_sleep.this[0] must be replaced
+/- resource "time_sleep" "this" {
      ~ id              = "2024-10-14T09:44:00Z" -> (known after apply)
      ~ triggers        = { # forces replacement
          ~ "cluster_certificate_authority_data" = "LS0tLS1CRUdJTiBDRVJUSUZJQ0FURS0tLS0tCk1JSURCVENDQWUyZ0F3SUJBZ0lJY0ZkOXNkNzZ1THN3RFFZSktvWklodmNOQVFFTEJRQXdGVEVUTUJFR0ExVUUKQXhNS2EzVmlaWEp1WlhSbGN6QWVGdzB5TkRFd01UUXdPVE16TkRsYUZ3MHpOREV3TVRJd09UTTRORGxhTUJVeApFekFSQmdOVkJBTVRDbXQxWW1WeWJtVjBaWE13Z2dFaU1BMEdDU3FHU0liM0RRRUJBUVVBQTRJQkR3QXdnZ0VLCkFvSUJBUUM1bzNZN3VzS1FOeFpQenBGcWxCUnNGTmtQYTlJMEdSMzhzREhaVmRCSVptc2VWaDBkTTFuWWVsbTMKNjRiSTJWQmJDZ1M3STY5eHg3Q2dZdEZyOXZ0NWF1MmtsMTR2V05nMVpaOFNML0s5TWc4MDRkLzRSelVJRmR3RQppZTJieDZ5OEZudmdEcHk1UnFjSzR0b1hvL1dYdk84RHhMckdZK0JaejRIbUFBVGx0SzVuWTVGVXhKVnJOZUpCCitWaUgyR0xPTWtsVHVKRDRKZTRCRzA4Q0hwTm5BeEhudjMwZm9PNjZrdnN5Ty9uc1I4bWxCeTFzTnE2SWVUUVIKK2Y2KzFJTjMrVlQyVHhud0l1bjlmWDc1akVqUkVvQzk0OGRDaG9Ecnl1U1FDKzM2YVpIS1RjVlBFVVVKNWprWQpTZkZhSHlRYlQzcnBvUVFLTGNzcmJTakh2M2tEQWdNQkFBR2pXVEJYTUE0R0ExVWREd0VCL3dRRUF3SUNwREFQCkJnTlZIUk1CQWY4RUJUQURBUUgvTUIwR0ExVWREZ1FXQkJUK0JkTXNzK1BjYmErVWFNb3dQN2VRNStDdklUQVYKQmdOVkhSRUVEakFNZ2dwcmRXSmxjbTVsZEdWek1BMEdDU3FHU0liM0RRRUJDd1VBQTRJQkFRQjA3a2tlUTZwYgowMmdaL1RrMWZYOGczVEwxVEZXS1lVRG51V2tIcms2VlB1NWk0TnpSMGZWSXJYTFI2MnE1VU4wbmwybDFXREhVCkZHSGVmeWFLZFdIY04wZ29veGF3TlVvNldsQTk4di9ZTXJVQ3VyQmNMSHdPUXR6TGtkL29lUVBsb1JubnNYVTkKWU9JTFVNY1ErcHh4WGdTMlJnMzBsVFZKYlc0SGM5WnNGS0hmNys5RzNsNkJQNVd2Ukl3RndSMVNHY3RHQlVMWgppK3U0dTY0cko1clpEMGRpZ3h4S2h1TEVCdG5SR25hSlZSQ3RENWJlUk8xTmtlMFhOZit5NmlBRDM4M2wwOG5aCk00YlptZTJsNjBhV0xGL1RoU1FSd0g4RkxURGxOcTBJckNrUDRxSUlpeHZoNW02UGx4Y294UmM5Snk2enFPekkKdGE3UkhSbktPVldTCi0tLS0tRU5EIENFUlRJRklDQVRFLS0tLS0K" -> (known after apply)
          ~ "cluster_endpoint"                   = "https://63F70535F3EBEB91D99661071E0DDAA4.gr7.ap-southeast-1.eks.amazonaws.com" -> (known after apply)
          ~ "cluster_name"                       = "bodhi-int-eks" -> "msccoin-int-eks"
          ~ "cluster_service_cidr"               = "172.20.0.0/16" -> (known after apply)
            # (1 unchanged element hidden)
        }
        # (1 unchanged attribute hidden)
    }

  # module.irsa-ebs-csi.data.aws_iam_policy_document.assume_role_with_oidc[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "assume_role_with_oidc" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)
    }

  # module.irsa-ebs-csi.aws_iam_role.this[0] must be replaced
-/+ resource "aws_iam_role" "this" {
      ~ arn                   = "arn:aws:iam::476114114107:role/AmazonEKSTFEBSCSIRole-ap-east-1-bodhi-int-eks" -> (known after apply)
      ~ assume_role_policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "sts:AssumeRoleWithWebIdentity"
                      - Condition = {
                          - StringEquals = {
                              - "oidc.eks.ap-southeast-1.amazonaws.com/id/63F70535F3EBEB91D99661071E0DDAA4:sub" = "system:serviceaccount:kube-system:ebs-csi-controller-sa"
                            }
                        }
                      - Effect    = "Allow"
                      - Principal = {
                          - Federated = "arn:aws:iam::476114114107:oidc-provider/oidc.eks.ap-southeast-1.amazonaws.com/id/63F70535F3EBEB91D99661071E0DDAA4"
                        }
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
      ~ create_date           = "2024-10-14T09:43:32Z" -> (known after apply)
      ~ id                    = "AmazonEKSTFEBSCSIRole-ap-east-1-bodhi-int-eks" -> (known after apply)
      ~ managed_policy_arns   = [
          - "arn:aws:iam::aws:policy/service-role/AmazonEBSCSIDriverPolicy",
        ] -> (known after apply)
      ~ name                  = "AmazonEKSTFEBSCSIRole-ap-east-1-bodhi-int-eks" -> "AmazonEKSTFEBSCSIRole-ap-east-1-msccoin-int-eks" # forces replacement
      + name_prefix           = (known after apply)
      - tags                  = {} -> null
      ~ tags_all              = {} -> (known after apply)
      ~ unique_id             = "AROAW5WU42Y5RARHXKXSJ" -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.irsa-ebs-csi.aws_iam_role_policy_attachment.custom[0] must be replaced
-/+ resource "aws_iam_role_policy_attachment" "custom" {
      ~ id         = "AmazonEKSTFEBSCSIRole-ap-east-1-bodhi-int-eks-2024101409433311580000000c" -> (known after apply)
      ~ role       = "AmazonEKSTFEBSCSIRole-ap-east-1-bodhi-int-eks" -> "AmazonEKSTFEBSCSIRole-ap-east-1-msccoin-int-eks" # forces replacement
        # (1 unchanged attribute hidden)
    }

  # module.vpc.aws_default_network_acl.this[0] will be created
  + resource "aws_default_network_acl" "this" {
      + arn                    = (known after apply)
      + default_network_acl_id = (known after apply)
      + id                     = (known after apply)
      + owner_id               = (known after apply)
      + tags                   = {
          + "Name"              = "terraform-managed-eks-vpc-default"
          + "environment"       = "int"
          + "terraform-managed" = "true"
        }
      + tags_all               = {
          + "Name"              = "terraform-managed-eks-vpc-default"
          + "environment"       = "int"
          + "terraform-managed" = "true"
        }
      + vpc_id                 = (known after apply)

      + egress {
          + action          = "allow"
          + from_port       = 0
          + ipv6_cidr_block = "::/0"
          + protocol        = "-1"
          + rule_no         = 101
          + to_port         = 0
            # (1 unchanged attribute hidden)
        }
      + egress {
          + action          = "allow"
          + cidr_block      = "0.0.0.0/0"
          + from_port       = 0
          + protocol        = "-1"
          + rule_no         = 100
          + to_port         = 0
            # (1 unchanged attribute hidden)
        }

      + ingress {
          + action          = "allow"
          + from_port       = 0
          + ipv6_cidr_block = "::/0"
          + protocol        = "-1"
          + rule_no         = 101
          + to_port         = 0
            # (1 unchanged attribute hidden)
        }
      + ingress {
          + action          = "allow"
          + cidr_block      = "0.0.0.0/0"
          + from_port       = 0
          + protocol        = "-1"
          + rule_no         = 100
          + to_port         = 0
            # (1 unchanged attribute hidden)
        }
    }

  # module.vpc.aws_default_route_table.default[0] will be created
  + resource "aws_default_route_table" "default" {
      + arn                    = (known after apply)
      + default_route_table_id = (known after apply)
      + id                     = (known after apply)
      + owner_id               = (known after apply)
      + route                  = (known after apply)
      + tags                   = {
          + "Name"              = "terraform-managed-eks-vpc-default"
          + "environment"       = "int"
          + "terraform-managed" = "true"
        }
      + tags_all               = {
          + "Name"              = "terraform-managed-eks-vpc-default"
          + "environment"       = "int"
          + "terraform-managed" = "true"
        }
      + vpc_id                 = (known after apply)

      + timeouts {
          + create = "5m"
          + update = "5m"
        }
    }

  # module.vpc.aws_default_security_group.this[0] will be created
  + resource "aws_default_security_group" "this" {
      + arn                    = (known after apply)
      + description            = (known after apply)
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = (known after apply)
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name"              = "terraform-managed-eks-vpc-default"
          + "environment"       = "int"
          + "terraform-managed" = "true"
        }
      + tags_all               = {
          + "Name"              = "terraform-managed-eks-vpc-default"
          + "environment"       = "int"
          + "terraform-managed" = "true"
        }
      + vpc_id                 = (known after apply)
    }

  # module.vpc.aws_internet_gateway.this[0] will be created
  + resource "aws_internet_gateway" "this" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + owner_id = (known after apply)
      + tags     = {
          + "Name"              = "terraform-managed-eks-vpc"
          + "environment"       = "int"
          + "terraform-managed" = "true"
        }
      + tags_all = {
          + "Name"              = "terraform-managed-eks-vpc"
          + "environment"       = "int"
          + "terraform-managed" = "true"
        }
      + vpc_id   = (known after apply)
    }

  # module.vpc.aws_nat_gateway.this[0] will be created
  + resource "aws_nat_gateway" "this" {
      + allocation_id                      = "eipalloc-0ea25e2b01d757771"
      + association_id                     = (known after apply)
      + connectivity_type                  = "public"
      + id                                 = (known after apply)
      + network_interface_id               = (known after apply)
      + private_ip                         = (known after apply)
      + public_ip                          = (known after apply)
      + secondary_private_ip_address_count = (known after apply)
      + secondary_private_ip_addresses     = (known after apply)
      + subnet_id                          = (known after apply)
      + tags                               = {
          + "Name"              = "terraform-managed-eks-vpc-ap-southeast-1a"
          + "environment"       = "int"
          + "terraform-managed" = "true"
        }
      + tags_all                           = {
          + "Name"              = "terraform-managed-eks-vpc-ap-southeast-1a"
          + "environment"       = "int"
          + "terraform-managed" = "true"
        }
    }

  # module.vpc.aws_nat_gateway.this[1] will be created
  + resource "aws_nat_gateway" "this" {
      + allocation_id                      = "eipalloc-0dfc3b169d203524d"
      + association_id                     = (known after apply)
      + connectivity_type                  = "public"
      + id                                 = (known after apply)
      + network_interface_id               = (known after apply)
      + private_ip                         = (known after apply)
      + public_ip                          = (known after apply)
      + secondary_private_ip_address_count = (known after apply)
      + secondary_private_ip_addresses     = (known after apply)
      + subnet_id                          = (known after apply)
      + tags                               = {
          + "Name"              = "terraform-managed-eks-vpc-ap-southeast-1b"
          + "environment"       = "int"
          + "terraform-managed" = "true"
        }
      + tags_all                           = {
          + "Name"              = "terraform-managed-eks-vpc-ap-southeast-1b"
          + "environment"       = "int"
          + "terraform-managed" = "true"
        }
    }

  # module.vpc.aws_nat_gateway.this[2] will be created
  + resource "aws_nat_gateway" "this" {
      + allocation_id                      = "eipalloc-0a64fef9f2231fb55"
      + association_id                     = (known after apply)
      + connectivity_type                  = "public"
      + id                                 = (known after apply)
      + network_interface_id               = (known after apply)
      + private_ip                         = (known after apply)
      + public_ip                          = (known after apply)
      + secondary_private_ip_address_count = (known after apply)
      + secondary_private_ip_addresses     = (known after apply)
      + subnet_id                          = (known after apply)
      + tags                               = {
          + "Name"              = "terraform-managed-eks-vpc-ap-southeast-1c"
          + "environment"       = "int"
          + "terraform-managed" = "true"
        }
      + tags_all                           = {
          + "Name"              = "terraform-managed-eks-vpc-ap-southeast-1c"
          + "environment"       = "int"
          + "terraform-managed" = "true"
        }
    }

  # module.vpc.aws_route.private_nat_gateway[0] will be created
  + resource "aws_route" "private_nat_gateway" {
      + destination_cidr_block = "0.0.0.0/0"
      + id                     = (known after apply)
      + instance_id            = (known after apply)
      + instance_owner_id      = (known after apply)
      + nat_gateway_id         = (known after apply)
      + network_interface_id   = (known after apply)
      + origin                 = (known after apply)
      + route_table_id         = (known after apply)
      + state                  = (known after apply)

      + timeouts {
          + create = "5m"
        }
    }

  # module.vpc.aws_route.private_nat_gateway[1] will be created
  + resource "aws_route" "private_nat_gateway" {
      + destination_cidr_block = "0.0.0.0/0"
      + id                     = (known after apply)
      + instance_id            = (known after apply)
      + instance_owner_id      = (known after apply)
      + nat_gateway_id         = (known after apply)
      + network_interface_id   = (known after apply)
      + origin                 = (known after apply)
      + route_table_id         = (known after apply)
      + state                  = (known after apply)

      + timeouts {
          + create = "5m"
        }
    }

  # module.vpc.aws_route.private_nat_gateway[2] will be created
  + resource "aws_route" "private_nat_gateway" {
      + destination_cidr_block = "0.0.0.0/0"
      + id                     = (known after apply)
      + instance_id            = (known after apply)
      + instance_owner_id      = (known after apply)
      + nat_gateway_id         = (known after apply)
      + network_interface_id   = (known after apply)
      + origin                 = (known after apply)
      + route_table_id         = (known after apply)
      + state                  = (known after apply)

      + timeouts {
          + create = "5m"
        }
    }

  # module.vpc.aws_route.public_internet_gateway[0] will be created
  + resource "aws_route" "public_internet_gateway" {
      + destination_cidr_block = "0.0.0.0/0"
      + gateway_id             = (known after apply)
      + id                     = (known after apply)
      + instance_id            = (known after apply)
      + instance_owner_id      = (known after apply)
      + network_interface_id   = (known after apply)
      + origin                 = (known after apply)
      + route_table_id         = (known after apply)
      + state                  = (known after apply)

      + timeouts {
          + create = "5m"
        }
    }

  # module.vpc.aws_route_table.private[0] will be created
  + resource "aws_route_table" "private" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Name"              = "terraform-managed-eks-vpc-private-ap-southeast-1a"
          + "environment"       = "int"
          + "terraform-managed" = "true"
        }
      + tags_all         = {
          + "Name"              = "terraform-managed-eks-vpc-private-ap-southeast-1a"
          + "environment"       = "int"
          + "terraform-managed" = "true"
        }
      + vpc_id           = (known after apply)
    }

  # module.vpc.aws_route_table.private[1] will be created
  + resource "aws_route_table" "private" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Name"              = "terraform-managed-eks-vpc-private-ap-southeast-1b"
          + "environment"       = "int"
          + "terraform-managed" = "true"
        }
      + tags_all         = {
          + "Name"              = "terraform-managed-eks-vpc-private-ap-southeast-1b"
          + "environment"       = "int"
          + "terraform-managed" = "true"
        }
      + vpc_id           = (known after apply)
    }

  # module.vpc.aws_route_table.private[2] will be created
  + resource "aws_route_table" "private" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Name"              = "terraform-managed-eks-vpc-private-ap-southeast-1c"
          + "environment"       = "int"
          + "terraform-managed" = "true"
        }
      + tags_all         = {
          + "Name"              = "terraform-managed-eks-vpc-private-ap-southeast-1c"
          + "environment"       = "int"
          + "terraform-managed" = "true"
        }
      + vpc_id           = (known after apply)
    }

  # module.vpc.aws_route_table.public[0] will be created
  + resource "aws_route_table" "public" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Name"              = "terraform-managed-eks-vpc-public"
          + "environment"       = "int"
          + "terraform-managed" = "true"
        }
      + tags_all         = {
          + "Name"              = "terraform-managed-eks-vpc-public"
          + "environment"       = "int"
          + "terraform-managed" = "true"
        }
      + vpc_id           = (known after apply)
    }

  # module.vpc.aws_route_table_association.private[0] will be created
  + resource "aws_route_table_association" "private" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_route_table_association.private[1] will be created
  + resource "aws_route_table_association" "private" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_route_table_association.private[2] will be created
  + resource "aws_route_table_association" "private" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_route_table_association.private[3] will be created
  + resource "aws_route_table_association" "private" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_route_table_association.private[4] will be created
  + resource "aws_route_table_association" "private" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_route_table_association.private[5] will be created
  + resource "aws_route_table_association" "private" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_route_table_association.public[0] will be created
  + resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_route_table_association.public[1] will be created
  + resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_route_table_association.public[2] will be created
  + resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_route_table_association.public[3] will be created
  + resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_route_table_association.public[4] will be created
  + resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_route_table_association.public[5] will be created
  + resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_subnet.private[0] will be created
  + resource "aws_subnet" "private" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "ap-southeast-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.1.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name"                            = "terraform-managed-eks-vpc-private-ap-southeast-1a"
          + "environment"                     = "int"
          + "kubernetes.io/role/internal-elb" = "1"
          + "terraform-managed"               = "true"
        }
      + tags_all                                       = {
          + "Name"                            = "terraform-managed-eks-vpc-private-ap-southeast-1a"
          + "environment"                     = "int"
          + "kubernetes.io/role/internal-elb" = "1"
          + "terraform-managed"               = "true"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.vpc.aws_subnet.private[1] will be created
  + resource "aws_subnet" "private" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "ap-southeast-1b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.2.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name"                            = "terraform-managed-eks-vpc-private-ap-southeast-1b"
          + "environment"                     = "int"
          + "kubernetes.io/role/internal-elb" = "1"
          + "terraform-managed"               = "true"
        }
      + tags_all                                       = {
          + "Name"                            = "terraform-managed-eks-vpc-private-ap-southeast-1b"
          + "environment"                     = "int"
          + "kubernetes.io/role/internal-elb" = "1"
          + "terraform-managed"               = "true"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.vpc.aws_subnet.private[2] will be created
  + resource "aws_subnet" "private" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "ap-southeast-1c"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.3.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name"                            = "terraform-managed-eks-vpc-private-ap-southeast-1c"
          + "environment"                     = "int"
          + "kubernetes.io/role/internal-elb" = "1"
          + "terraform-managed"               = "true"
        }
      + tags_all                                       = {
          + "Name"                            = "terraform-managed-eks-vpc-private-ap-southeast-1c"
          + "environment"                     = "int"
          + "kubernetes.io/role/internal-elb" = "1"
          + "terraform-managed"               = "true"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.vpc.aws_subnet.private[3] will be created
  + resource "aws_subnet" "private" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "ap-southeast-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.32.0.0/18"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name"                            = "terraform-managed-eks-vpc-private-ap-southeast-1a"
          + "environment"                     = "int"
          + "kubernetes.io/role/internal-elb" = "1"
          + "terraform-managed"               = "true"
        }
      + tags_all                                       = {
          + "Name"                            = "terraform-managed-eks-vpc-private-ap-southeast-1a"
          + "environment"                     = "int"
          + "kubernetes.io/role/internal-elb" = "1"
          + "terraform-managed"               = "true"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.vpc.aws_subnet.private[4] will be created
  + resource "aws_subnet" "private" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "ap-southeast-1b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.32.64.0/18"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name"                            = "terraform-managed-eks-vpc-private-ap-southeast-1b"
          + "environment"                     = "int"
          + "kubernetes.io/role/internal-elb" = "1"
          + "terraform-managed"               = "true"
        }
      + tags_all                                       = {
          + "Name"                            = "terraform-managed-eks-vpc-private-ap-southeast-1b"
          + "environment"                     = "int"
          + "kubernetes.io/role/internal-elb" = "1"
          + "terraform-managed"               = "true"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.vpc.aws_subnet.private[5] will be created
  + resource "aws_subnet" "private" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "ap-southeast-1c"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.32.128.0/18"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name"                            = "terraform-managed-eks-vpc-private-ap-southeast-1c"
          + "environment"                     = "int"
          + "kubernetes.io/role/internal-elb" = "1"
          + "terraform-managed"               = "true"
        }
      + tags_all                                       = {
          + "Name"                            = "terraform-managed-eks-vpc-private-ap-southeast-1c"
          + "environment"                     = "int"
          + "kubernetes.io/role/internal-elb" = "1"
          + "terraform-managed"               = "true"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.vpc.aws_subnet.public[0] will be created
  + resource "aws_subnet" "public" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "ap-southeast-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.10.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = true
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name"                   = "terraform-managed-eks-vpc-public-ap-southeast-1a"
          + "environment"            = "int"
          + "kubernetes.io/role/elb" = "1"
          + "terraform-managed"      = "true"
        }
      + tags_all                                       = {
          + "Name"                   = "terraform-managed-eks-vpc-public-ap-southeast-1a"
          + "environment"            = "int"
          + "kubernetes.io/role/elb" = "1"
          + "terraform-managed"      = "true"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.vpc.aws_subnet.public[1] will be created
  + resource "aws_subnet" "public" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "ap-southeast-1b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.20.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = true
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name"                   = "terraform-managed-eks-vpc-public-ap-southeast-1b"
          + "environment"            = "int"
          + "kubernetes.io/role/elb" = "1"
          + "terraform-managed"      = "true"
        }
      + tags_all                                       = {
          + "Name"                   = "terraform-managed-eks-vpc-public-ap-southeast-1b"
          + "environment"            = "int"
          + "kubernetes.io/role/elb" = "1"
          + "terraform-managed"      = "true"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.vpc.aws_subnet.public[2] will be created
  + resource "aws_subnet" "public" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "ap-southeast-1c"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.30.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = true
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name"                   = "terraform-managed-eks-vpc-public-ap-southeast-1c"
          + "environment"            = "int"
          + "kubernetes.io/role/elb" = "1"
          + "terraform-managed"      = "true"
        }
      + tags_all                                       = {
          + "Name"                   = "terraform-managed-eks-vpc-public-ap-southeast-1c"
          + "environment"            = "int"
          + "kubernetes.io/role/elb" = "1"
          + "terraform-managed"      = "true"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.vpc.aws_subnet.public[3] will be created
  + resource "aws_subnet" "public" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "ap-southeast-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.32.192.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = true
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name"                   = "terraform-managed-eks-vpc-public-ap-southeast-1a"
          + "environment"            = "int"
          + "kubernetes.io/role/elb" = "1"
          + "terraform-managed"      = "true"
        }
      + tags_all                                       = {
          + "Name"                   = "terraform-managed-eks-vpc-public-ap-southeast-1a"
          + "environment"            = "int"
          + "kubernetes.io/role/elb" = "1"
          + "terraform-managed"      = "true"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.vpc.aws_subnet.public[4] will be created
  + resource "aws_subnet" "public" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "ap-southeast-1b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.32.193.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = true
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name"                   = "terraform-managed-eks-vpc-public-ap-southeast-1b"
          + "environment"            = "int"
          + "kubernetes.io/role/elb" = "1"
          + "terraform-managed"      = "true"
        }
      + tags_all                                       = {
          + "Name"                   = "terraform-managed-eks-vpc-public-ap-southeast-1b"
          + "environment"            = "int"
          + "kubernetes.io/role/elb" = "1"
          + "terraform-managed"      = "true"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.vpc.aws_subnet.public[5] will be created
  + resource "aws_subnet" "public" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "ap-southeast-1c"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.32.194.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = true
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name"                   = "terraform-managed-eks-vpc-public-ap-southeast-1c"
          + "environment"            = "int"
          + "kubernetes.io/role/elb" = "1"
          + "terraform-managed"      = "true"
        }
      + tags_all                                       = {
          + "Name"                   = "terraform-managed-eks-vpc-public-ap-southeast-1c"
          + "environment"            = "int"
          + "kubernetes.io/role/elb" = "1"
          + "terraform-managed"      = "true"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.vpc.aws_vpc.this[0] will be created
  + resource "aws_vpc" "this" {
      + arn                                  = (known after apply)
      + cidr_block                           = "10.0.0.0/16"
      + default_network_acl_id               = (known after apply)
      + default_route_table_id               = (known after apply)
      + default_security_group_id            = (known after apply)
      + dhcp_options_id                      = (known after apply)
      + enable_dns_hostnames                 = true
      + enable_dns_support                   = true
      + enable_network_address_usage_metrics = (known after apply)
      + id                                   = (known after apply)
      + instance_tenancy                     = "default"
      + ipv6_association_id                  = (known after apply)
      + ipv6_cidr_block                      = (known after apply)
      + ipv6_cidr_block_network_border_group = (known after apply)
      + main_route_table_id                  = (known after apply)
      + owner_id                             = (known after apply)
      + tags                                 = {
          + "Name"              = "terraform-managed-eks-vpc"
          + "environment"       = "int"
          + "terraform-managed" = "true"
        }
      + tags_all                             = {
          + "Name"              = "terraform-managed-eks-vpc"
          + "environment"       = "int"
          + "terraform-managed" = "true"
        }
    }

  # module.vpc.aws_vpc_ipv4_cidr_block_association.this[0] will be created
  + resource "aws_vpc_ipv4_cidr_block_association" "this" {
      + cidr_block = "10.32.0.0/16"
      + id         = (known after apply)
      + vpc_id     = (known after apply)
    }

  # module.eks.module.eks_managed_node_group["int"].aws_eks_node_group.this[0] will be created
  + resource "aws_eks_node_group" "this" {
      + ami_type               = "AL2_x86_64"
      + arn                    = (known after apply)
      + capacity_type          = "ON_DEMAND"
      + cluster_name           = "msccoin-int-eks"
      + disk_size              = (known after apply)
      + id                     = (known after apply)
      + instance_types         = [
          + "t3a.medium",
        ]
      + labels                 = {
          + "nodegroup" = "int"
        }
      + node_group_name        = (known after apply)
      + node_group_name_prefix = "int-"
      + node_role_arn          = "arn:aws:iam::476114114107:role/int-eks-node-group-20241014093431551400000001"
      + release_version        = (known after apply)
      + resources              = (known after apply)
      + status                 = (known after apply)
      + subnet_ids             = (known after apply)
      + tags                   = {
          + "Name"                                      = "int"
          + "k8s.io/cluster-autoscaler/enabled"         = "TRUE"
          + "k8s.io/cluster-autoscaler/msccoin-int-eks" = "owned"
        }
      + tags_all               = {
          + "Name"                                      = "int"
          + "k8s.io/cluster-autoscaler/enabled"         = "TRUE"
          + "k8s.io/cluster-autoscaler/msccoin-int-eks" = "owned"
        }
      + version                = "1.29"

      + launch_template {
          + id      = "lt-01490e17eecf85913"
          + name    = (known after apply)
          + version = (known after apply)
        }

      + scaling_config {
          + desired_size = 2
          + max_size     = 10
          + min_size     = 1
        }

      + timeouts {}

      + update_config {
          + max_unavailable_percentage = 33
        }
    }

  # module.eks.module.eks_managed_node_group["int"].aws_iam_role.this[0] will be updated in-place
  ~ resource "aws_iam_role" "this" {
        id                    = "int-eks-node-group-20241014093431551400000001"
        name                  = "int-eks-node-group-20241014093431551400000001"
      ~ tags                  = {
          - "k8s.io/cluster-autoscaler/bodhi-int-eks"   = "owned" -> null
            "k8s.io/cluster-autoscaler/enabled"         = "TRUE"
          + "k8s.io/cluster-autoscaler/msccoin-int-eks" = "owned"
        }
      ~ tags_all              = {
          - "k8s.io/cluster-autoscaler/bodhi-int-eks"   = "owned" -> null
          + "k8s.io/cluster-autoscaler/msccoin-int-eks" = "owned"
            # (1 unchanged element hidden)
        }
        # (11 unchanged attributes hidden)
    }

  # module.eks.module.eks_managed_node_group["int"].aws_launch_template.this[0] will be updated in-place
  ~ resource "aws_launch_template" "this" {
      ~ default_version                      = 1 -> (known after apply)
        id                                   = "lt-01490e17eecf85913"
      ~ latest_version                       = 1 -> (known after apply)
        name                                 = "int-2024101409440248660000000d"
      ~ tags                                 = {
          - "k8s.io/cluster-autoscaler/bodhi-int-eks"   = "owned" -> null
            "k8s.io/cluster-autoscaler/enabled"         = "TRUE"
          + "k8s.io/cluster-autoscaler/msccoin-int-eks" = "owned"
        }
      ~ tags_all                             = {
          - "k8s.io/cluster-autoscaler/bodhi-int-eks"   = "owned" -> null
          + "k8s.io/cluster-autoscaler/msccoin-int-eks" = "owned"
            # (1 unchanged element hidden)
        }
      ~ vpc_security_group_ids               = [
          - "sg-0559079df1e6144e8",
        ] -> (known after apply)
        # (15 unchanged attributes hidden)

      ~ tag_specifications {
          ~ tags          = {
                "Name"                                      = "int"
              - "k8s.io/cluster-autoscaler/bodhi-int-eks"   = "owned" -> null
                "k8s.io/cluster-autoscaler/enabled"         = "TRUE"
              + "k8s.io/cluster-autoscaler/msccoin-int-eks" = "owned"
            }
            # (1 unchanged attribute hidden)
        }
      ~ tag_specifications {
          ~ tags          = {
                "Name"                                      = "int"
              - "k8s.io/cluster-autoscaler/bodhi-int-eks"   = "owned" -> null
                "k8s.io/cluster-autoscaler/enabled"         = "TRUE"
              + "k8s.io/cluster-autoscaler/msccoin-int-eks" = "owned"
            }
            # (1 unchanged attribute hidden)
        }
      ~ tag_specifications {
          ~ tags          = {
                "Name"                                      = "int"
              - "k8s.io/cluster-autoscaler/bodhi-int-eks"   = "owned" -> null
                "k8s.io/cluster-autoscaler/enabled"         = "TRUE"
              + "k8s.io/cluster-autoscaler/msccoin-int-eks" = "owned"
            }
            # (1 unchanged attribute hidden)
        }

        # (2 unchanged blocks hidden)
    }

  # module.eks.module.eks_managed_node_group["k8s-core"].aws_eks_node_group.this[0] will be created
  + resource "aws_eks_node_group" "this" {
      + ami_type               = "AL2_x86_64"
      + arn                    = (known after apply)
      + capacity_type          = "ON_DEMAND"
      + cluster_name           = "msccoin-int-eks"
      + disk_size              = (known after apply)
      + id                     = (known after apply)
      + instance_types         = [
          + "t3.micro",
        ]
      + labels                 = {
          + "nodegroup" = "k8s-core"
        }
      + node_group_name        = (known after apply)
      + node_group_name_prefix = "k8s-core-"
      + node_role_arn          = "arn:aws:iam::476114114107:role/k8s-core-eks-node-group-20241014093431756400000002"
      + release_version        = (known after apply)
      + resources              = (known after apply)
      + status                 = (known after apply)
      + subnet_ids             = (known after apply)
      + tags                   = {
          + "Name"                                      = "k8s-core"
          + "k8s.io/cluster-autoscaler/enabled"         = "TRUE"
          + "k8s.io/cluster-autoscaler/msccoin-int-eks" = "owned"
        }
      + tags_all               = {
          + "Name"                                      = "k8s-core"
          + "k8s.io/cluster-autoscaler/enabled"         = "TRUE"
          + "k8s.io/cluster-autoscaler/msccoin-int-eks" = "owned"
        }
      + version                = "1.29"

      + launch_template {
          + id      = "lt-0d41e868704652f3f"
          + name    = (known after apply)
          + version = (known after apply)
        }

      + scaling_config {
          + desired_size = 2
          + max_size     = 10
          + min_size     = 1
        }

      + timeouts {}

      + update_config {
          + max_unavailable_percentage = 33
        }
    }

  # module.eks.module.eks_managed_node_group["k8s-core"].aws_iam_role.this[0] will be updated in-place
  ~ resource "aws_iam_role" "this" {
        id                    = "k8s-core-eks-node-group-20241014093431756400000002"
        name                  = "k8s-core-eks-node-group-20241014093431756400000002"
      ~ tags                  = {
          - "k8s.io/cluster-autoscaler/bodhi-int-eks"   = "owned" -> null
            "k8s.io/cluster-autoscaler/enabled"         = "TRUE"
          + "k8s.io/cluster-autoscaler/msccoin-int-eks" = "owned"
        }
      ~ tags_all              = {
          - "k8s.io/cluster-autoscaler/bodhi-int-eks"   = "owned" -> null
          + "k8s.io/cluster-autoscaler/msccoin-int-eks" = "owned"
            # (1 unchanged element hidden)
        }
        # (11 unchanged attributes hidden)
    }

  # module.eks.module.eks_managed_node_group["k8s-core"].aws_launch_template.this[0] will be updated in-place
  ~ resource "aws_launch_template" "this" {
      ~ default_version                      = 1 -> (known after apply)
        id                                   = "lt-0d41e868704652f3f"
      ~ latest_version                       = 1 -> (known after apply)
        name                                 = "k8s-core-2024101409440248710000000f"
      ~ tags                                 = {
          - "k8s.io/cluster-autoscaler/bodhi-int-eks"   = "owned" -> null
            "k8s.io/cluster-autoscaler/enabled"         = "TRUE"
          + "k8s.io/cluster-autoscaler/msccoin-int-eks" = "owned"
        }
      ~ tags_all                             = {
          - "k8s.io/cluster-autoscaler/bodhi-int-eks"   = "owned" -> null
          + "k8s.io/cluster-autoscaler/msccoin-int-eks" = "owned"
            # (1 unchanged element hidden)
        }
      ~ vpc_security_group_ids               = [
          - "sg-0559079df1e6144e8",
        ] -> (known after apply)
        # (15 unchanged attributes hidden)

      ~ tag_specifications {
          ~ tags          = {
                "Name"                                      = "k8s-core"
              - "k8s.io/cluster-autoscaler/bodhi-int-eks"   = "owned" -> null
                "k8s.io/cluster-autoscaler/enabled"         = "TRUE"
              + "k8s.io/cluster-autoscaler/msccoin-int-eks" = "owned"
            }
            # (1 unchanged attribute hidden)
        }
      ~ tag_specifications {
          ~ tags          = {
                "Name"                                      = "k8s-core"
              - "k8s.io/cluster-autoscaler/bodhi-int-eks"   = "owned" -> null
                "k8s.io/cluster-autoscaler/enabled"         = "TRUE"
              + "k8s.io/cluster-autoscaler/msccoin-int-eks" = "owned"
            }
            # (1 unchanged attribute hidden)
        }
      ~ tag_specifications {
          ~ tags          = {
                "Name"                                      = "k8s-core"
              - "k8s.io/cluster-autoscaler/bodhi-int-eks"   = "owned" -> null
                "k8s.io/cluster-autoscaler/enabled"         = "TRUE"
              + "k8s.io/cluster-autoscaler/msccoin-int-eks" = "owned"
            }
            # (1 unchanged attribute hidden)
        }

        # (2 unchanged blocks hidden)
    }

  # module.eks.module.kms.data.aws_iam_policy_document.this[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "this" {
      + id                        = (known after apply)
      + json                      = (known after apply)
      + minified_json             = (known after apply)
      + override_policy_documents = []
      + source_policy_documents   = []

      + statement {
          + actions   = [
              + "kms:*",
            ]
          + resources = [
              + "*",
            ]
          + sid       = "Default"

          + principals {
              + identifiers = [
                  + "arn:aws:iam::476114114107:root",
                ]
              + type        = "AWS"
            }
        }
      + statement {
          + actions   = [
              + "kms:CancelKeyDeletion",
              + "kms:Create*",
              + "kms:Delete*",
              + "kms:Describe*",
              + "kms:Disable*",
              + "kms:Enable*",
              + "kms:Get*",
              + "kms:ImportKeyMaterial",
              + "kms:List*",
              + "kms:Put*",
              + "kms:ReplicateKey",
              + "kms:Revoke*",
              + "kms:ScheduleKeyDeletion",
              + "kms:TagResource",
              + "kms:UntagResource",
              + "kms:Update*",
            ]
          + resources = [
              + "*",
            ]
          + sid       = "KeyAdministration"

          + principals {
              + identifiers = [
                  + "arn:aws:iam::476114114107:role/github-oidc-role",
                ]
              + type        = "AWS"
            }
        }
      + statement {
          + actions   = [
              + "kms:Decrypt",
              + "kms:DescribeKey",
              + "kms:Encrypt",
              + "kms:GenerateDataKey*",
              + "kms:ReEncrypt*",
            ]
          + resources = [
              + "*",
            ]
          + sid       = "KeyUsage"

          + principals {
              + identifiers = [
                  + (known after apply),
                ]
              + type        = "AWS"
            }
        }
    }

  # module.eks.module.kms.aws_kms_alias.this["cluster"] must be replaced
-/+ resource "aws_kms_alias" "this" {
      ~ arn            = "arn:aws:kms:ap-southeast-1:476114114107:alias/eks/bodhi-int-eks" -> (known after apply)
      ~ id             = "alias/eks/bodhi-int-eks" -> (known after apply)
      ~ name           = "alias/eks/bodhi-int-eks" -> "alias/eks/msccoin-int-eks" # forces replacement
      + name_prefix    = (known after apply)
      ~ target_key_arn = "arn:aws:kms:ap-southeast-1:476114114107:key/f2ff4364-802e-4cfb-b72e-c6df357506fd" -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # module.eks.module.kms.aws_kms_key.this[0] will be updated in-place
  ~ resource "aws_kms_key" "this" {
      ~ description                        = "bodhi-int-eks cluster encryption key" -> "msccoin-int-eks cluster encryption key"
        id                                 = "f2ff4364-802e-4cfb-b72e-c6df357506fd"
      ~ policy                             = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "kms:*"
                      - Effect    = "Allow"
                      - Principal = {
                          - AWS = "arn:aws:iam::476114114107:root"
                        }
                      - Resource  = "*"
                      - Sid       = "Default"
                    },
                  - {
                      - Action    = [
                          - "kms:Update*",
                          - "kms:UntagResource",
                          - "kms:TagResource",
                          - "kms:ScheduleKeyDeletion",
                          - "kms:Revoke*",
                          - "kms:ReplicateKey",
                          - "kms:Put*",
                          - "kms:List*",
                          - "kms:ImportKeyMaterial",
                          - "kms:Get*",
                          - "kms:Enable*",
                          - "kms:Disable*",
                          - "kms:Describe*",
                          - "kms:Delete*",
                          - "kms:Create*",
                          - "kms:CancelKeyDeletion",
                        ]
                      - Effect    = "Allow"
                      - Principal = {
                          - AWS = "arn:aws:iam::476114114107:role/github-oidc-role"
                        }
                      - Resource  = "*"
                      - Sid       = "KeyAdministration"
                    },
                  - {
                      - Action    = [
                          - "kms:ReEncrypt*",
                          - "kms:GenerateDataKey*",
                          - "kms:Encrypt",
                          - "kms:DescribeKey",
                          - "kms:Decrypt",
                        ]
                      - Effect    = "Allow"
                      - Principal = {
                          - AWS = "arn:aws:iam::476114114107:role/bodhi-int-eks-cluster-20241014091753202000000001"
                        }
                      - Resource  = "*"
                      - Sid       = "KeyUsage"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        tags                               = {
            "terraform-aws-modules" = "eks"
        }
        # (12 unchanged attributes hidden)
    }

Plan: 73 to add, 5 to change, 11 to destroy.

Warning: Argument is deprecated

  with module.eks.aws_iam_role.this[0],
  on .terraform/modules/eks/main.tf line 387, in resource "aws_iam_role" "this":
 387: resource "aws_iam_role" "this" {

inline_policy is deprecated. Use the aws_iam_role_policy resource instead. If
Terraform should exclusively manage all inline policy associations (the
current behavior of this argument), use the aws_iam_role_policies_exclusive
resource as well.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @DavidGoodman2333, Action: `pull_request`, Working Directory: ``, Workflow: `Terraform Infra Plan - AP Southeast 1`*